org/traefik.org
#+TITLE: Traefik 代理研究

* 前言
Traefik(https://traefik.io/) 是一个网络流量代理。目前支持http，https，tcp流量代理.
由于选择使用Traefik 来作为公司服务网格的数据面，所以研究了一下Traefik代码并添加了一些新功能。
** 主要特性
- 支持负载均衡
- 支持动态配置
- 支持路由选择
- 支持中间件
- 支持插件机制(还比较新，不大稳定)
- 支持webUI
** Benchmark:
- https://github.com/NickMRamirez/Proxy-Benchmarks
就压测情况来看，Traefik略逊于nginx。对于我们公司的业务场景来说，还算能够接受的。
** 使用方式
*** 数据面
在我们的实现的Service Mesh中，计划使用Traefik作为我们的数据面，所以Traefik需要以下特性：
- 能够支持透明代理（比如由iptables直接劫持过来的流量）
- 支持从控制面获取配置
- 支持协议探测
*** Ingress 网关
同样，我们计划使用Traefik来替代我们的nginx，同样能够通过控制面来管理我们的入口网关，所以Traefik需要以下特性：
- 支持路由配置应用到Ingress还是数据面
- 支持流量权重配置
- 支持虚拟service
- 支持自定义路由规则等
* 架构
Traefik的代码十分简洁，对于主要的代理功能来说主要分为以下几个部分：
  - 路由功能
  - 反向代理
  - 配置获取
  - 中间件
  - 动态插件
** 反向代理
作为一个代理服务来说，Traefik的基本功能就是用作反向代理。由于Traefik的tcp代理是2.0新加的功能，所以对于Traefik的设计上不支持协议探测功能，必须手动指定代理服务的协议，否则使用默认协议。
