traefik.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-01-22 Fri 22:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Traefik 代理研究</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="./css/org-css.css"/>
<link rel="stylesheet" type="text/css" href="./css/gitalk.css"/></head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Traefik 代理研究</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5335246">1. 前言</a>
<ul>
<li><a href="#orgc729fbd">1.1. 主要特性</a></li>
<li><a href="#orgbfe820c">1.2. Benchmark:</a></li>
<li><a href="#orgd5fee3c">1.3. 使用方式</a></li>
<li><a href="#orga7e7b7c">1.4. 数据面</a></li>
<li><a href="#org7ac44e4">1.5. Ingress 网关</a></li>
</ul>
</li>
<li><a href="#org9230894">2. 架构</a>
<ul>
<li><a href="#org27798c4">2.1. 反向代理</a></li>
<li><a href="#org6a2ecbb">2.2. HTTP 协议</a></li>
<li><a href="#orgb207aec">2.3. TCP 协议</a></li>
<li><a href="#orgca6a988">2.4. 负载均衡</a></li>
<li><a href="#orga08195a">2.5. 配置获取</a></li>
<li><a href="#orga7583eb">2.6. 动态插件</a></li>
<li><a href="#org3fe4339">2.7. 中间件</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org5335246" class="outline-2">
<h2 id="org5335246"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
Traefik(<a href="https://traefik.io/">https://traefik.io/</a>) 是一个网络流量代理。目前支持http，https，tcp流量代理.
由于选择使用Traefik 来作为公司服务网格的数据面，所以研究了一下Traefik代码并添加了一些新功能。
</p>
</div>
<div id="outline-container-orgc729fbd" class="outline-3">
<h3 id="orgc729fbd"><span class="section-number-3">1.1</span> 主要特性</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>支持负载均衡</li>
<li>支持动态配置</li>
<li>支持路由选择</li>
<li>支持中间件</li>
<li>支持插件机制(还比较新，不大稳定)</li>
<li>支持webUI</li>
</ul>
</div>
</div>

<div id="outline-container-orgbfe820c" class="outline-3">
<h3 id="orgbfe820c"><span class="section-number-3">1.2</span> Benchmark:</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><a href="https://github.com/NickMRamirez/Proxy-Benchmarks">https://github.com/NickMRamirez/Proxy-Benchmarks</a></li>
</ul>
<p>
就压测情况来看，Traefik略逊于nginx。对于我们公司的业务场景来说，还算能够接受的。
</p>
</div>
</div>
<div id="outline-container-orgd5fee3c" class="outline-3">
<h3 id="orgd5fee3c"><span class="section-number-3">1.3</span> 使用方式</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-orga7e7b7c" class="outline-3">
<h3 id="orga7e7b7c"><span class="section-number-3">1.4</span> 数据面</h3>
<div class="outline-text-3" id="text-1-4">
<p>
在我们的实现的Service Mesh中，计划使用Traefik作为我们的数据面，所以Traefik需要以下特性：
</p>
<ul class="org-ul">
<li>能够支持透明代理（比如由iptables直接劫持过来的流量）</li>
<li>支持从控制面获取配置</li>
<li>支持协议探测</li>
</ul>
</div>
</div>
<div id="outline-container-org7ac44e4" class="outline-3">
<h3 id="org7ac44e4"><span class="section-number-3">1.5</span> Ingress 网关</h3>
<div class="outline-text-3" id="text-1-5">
<p>
同样，我们计划使用Traefik来替代我们的nginx，同样能够通过控制面来管理我们的入口网关，所以Traefik需要以下特性：
</p>
<ul class="org-ul">
<li>支持路由配置应用到Ingress还是数据面</li>
<li>支持流量权重配置</li>
<li>支持虚拟service</li>
<li>支持自定义路由规则等</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org9230894" class="outline-2">
<h2 id="org9230894"><span class="section-number-2">2</span> 架构</h2>
<div class="outline-text-2" id="text-2">
<p>
Traefik的代码十分简洁，对于主要的代理功能来说主要分为以下几个部分：
</p>
<ul class="org-ul">
<li>路由功能</li>
<li>反向代理</li>
<li>配置获取</li>
<li>中间件</li>
<li>动态插件</li>
</ul>
</div>
<div id="outline-container-org27798c4" class="outline-3">
<h3 id="org27798c4"><span class="section-number-3">2.1</span> 反向代理</h3>
<div class="outline-text-3" id="text-2-1">
<p>
作为一个代理服务来说，Traefik的基本功能就是用作反向代理。由于Traefik的tcp代理是2.0新加的功能，所以对于Traefik的设计上不支持协议探测功能，必须手动指定代理服务的协议，否则使用默认协议。
</p>
</div>
