org/traefik.org
*** HTTP 协议
http的反向代理，Traefik 使用的是golang 标准库的包, 代码如下：
#+begin_src go 
// pkg/server/service/proxy.go
  func buildProxy(passHostHeader *bool, responseForwarding *dynamic.ResponseForwarding, roundTripper http.RoundTripper, bufferPool httputil.BufferPool) (http.Handler, error) {
         //.... 去掉不影响逻辑的代码 
          proxy := &httputil.ReverseProxy{
                  Director: func(outReq *http.Request) {
                          u := outReq.URL
                          if outReq.RequestURI != "" {
                                  parsedURL, err := url.ParseRequestURI(outReq.RequestURI)
                                  if err == nil {
                                          u = parsedURL
                                  }
                          }

                          outReq.URL.Path = u.Path
                          outReq.URL.RawPath = u.RawPath
                          outReq.URL.RawQuery = u.RawQuery
                          outReq.RequestURI = "" // Outgoing request should not have RequestURI

                          outReq.Proto = "HTTP/1.1"
                          outReq.ProtoMajor = 1
                          outReq.ProtoMinor = 1

                          if _, ok := outReq.Header["User-Agent"]; !ok {
                                  outReq.Header.Set("User-Agent", "")
                          }

                          // Do not pass client Host header unless optsetter PassHostHeader is set.
                          if passHostHeader != nil && !*passHostHeader {
                                  outReq.Host = outReq.URL.Host
                          }

                          // Even if the websocket RFC says that headers should be case-insensitive,
                          // some servers need Sec-WebSocket-Key, Sec-WebSocket-Extensions, Sec-WebSocket-Accept,
                          // Sec-WebSocket-Protocol and Sec-WebSocket-Version to be case-sensitive.
                          // https://tools.ietf.org/html/rfc6455#page-20
                          outReq.Header["Sec-WebSocket-Key"] = outReq.Header["Sec-Websocket-Key"]
                          outReq.Header["Sec-WebSocket-Extensions"] = outReq.Header["Sec-Websocket-Extensions"]
                          outReq.Header["Sec-WebSocket-Accept"] = outReq.Header["Sec-Websocket-Accept"]
                          outReq.Header["Sec-WebSocket-Protocol"] = outReq.Header["Sec-Websocket-Protocol"]
                          outReq.Header["Sec-WebSocket-Version"] = outReq.Header["Sec-Websocket-Version"]
                          delete(outReq.Header, "Sec-Websocket-Key")
                          delete(outReq.Header, "Sec-Websocket-Extensions")
                          delete(outReq.Header, "Sec-Websocket-Accept")
                          delete(outReq.Header, "Sec-Websocket-Protocol")
                          delete(outReq.Header, "Sec-Websocket-Version")
                  },
                  Transport:     roundTripper,
                  FlushInterval: time.Duration(flushInterval),
                  BufferPool:    bufferPool,
                  ErrorHandler: func(w http.ResponseWriter, request *http.Request, err error) {
                          statusCode := http.StatusInternalServerError

                          switch {
                          case err == io.EOF:
                                  statusCode = http.StatusBadGateway
                          case err == context.Canceled:
                                  statusCode = StatusClientClosedRequest
                          default:
                                  if e, ok := err.(net.Error); ok {
                                          if e.Timeout() {
                                                  statusCode = http.StatusGatewayTimeout
                                          } else {
                                                  statusCode = http.StatusBadGateway
                                          }
                                  }
                          }

                          log.Debugf("'%d %s' caused by: %v", statusCode, statusText(statusCode), err)
                          w.WriteHeader(statusCode)
                          _, werr := w.Write([]byte(statusText(statusCode)))
                          if werr != nil {
                                  log.Debugf("Error while writing status code", werr)
                          }
                  },
          }

          return proxy, nil
  }
#+end_src
这里没有设置的代理的后端地址的原因是，负责均衡包会动态改变请求的后端地址，所以反向代理就不用更改了。
