traefik.html
<div id="outline-container-org6a2ecbb" class="outline-3">
<h3 id="org6a2ecbb"><span class="section-number-3">2.2</span> HTTP 协议</h3>
<div class="outline-text-3" id="text-2-2">
<p>
http的反向代理，Traefik 使用的是golang 标准库的包, 代码如下：
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #676E95;">// </span><span style="color: #676E95;">pkg/server/service/proxy.go</span>
  <span style="color: #89DDFF;">func</span> <span style="color: #82aaff;">buildProxy</span>(<span style="color: #ffcb6b;">passHostHeader</span> *<span style="color: #c792ea;">bool</span>, <span style="color: #ffcb6b;">responseForwarding</span> *<span style="color: #c792ea;">dynamic.ResponseForwarding</span>, <span style="color: #ffcb6b;">roundTripper</span> <span style="color: #c792ea;">http.RoundTripper</span>, <span style="color: #ffcb6b;">bufferPool</span> <span style="color: #c792ea;">httputil.BufferPool</span>) (<span style="color: #c792ea;">http.Handler</span>, <span style="color: #c792ea;">error</span>) {
     <span style="color: #676E95;">//</span><span style="color: #676E95;">.... &#21435;&#25481;&#19981;&#24433;&#21709;&#36923;&#36753;&#30340;&#20195;&#30721; </span>
      <span style="color: #ffcb6b;">proxy</span> := &amp;<span style="color: #c792ea;">httputil.ReverseProxy</span>{
          <span style="color: #f78c6c;">Director</span>: <span style="color: #89DDFF;">func</span>(<span style="color: #ffcb6b;">outReq</span> *<span style="color: #c792ea;">http.Request</span>) {
              <span style="color: #ffcb6b;">u</span> := outReq.URL
              <span style="color: #89DDFF;">if</span> outReq.RequestURI != <span style="color: #c3e88d;">""</span> {
                  <span style="color: #ffcb6b;">parsedURL</span>, <span style="color: #ffcb6b;">err</span> := url.<span style="color: #82aaff;">ParseRequestURI</span>(outReq.RequestURI)
                  <span style="color: #89DDFF;">if</span> err == <span style="color: #f78c6c;">nil</span> {
                      u = parsedURL
                  }
              }

              outReq.URL.Path = u.Path
              outReq.URL.RawPath = u.RawPath
              outReq.URL.RawQuery = u.RawQuery
              outReq.RequestURI = <span style="color: #c3e88d;">""</span> <span style="color: #676E95;">// </span><span style="color: #676E95;">Outgoing request should not have RequestURI</span>

              outReq.Proto = <span style="color: #c3e88d;">"HTTP/1.1"</span>
              outReq.ProtoMajor = 1
              outReq.ProtoMinor = 1

              <span style="color: #89DDFF;">if</span> <span style="color: #ffcb6b;">_</span>, <span style="color: #ffcb6b;">ok</span> := outReq.Header[<span style="color: #c3e88d;">"User-Agent"</span>]; <span style="color: #89DDFF; font-weight: bold;">!</span>ok {
                  outReq.Header.<span style="color: #82aaff;">Set</span>(<span style="color: #c3e88d;">"User-Agent"</span>, <span style="color: #c3e88d;">""</span>)
              }

              <span style="color: #676E95;">// </span><span style="color: #676E95;">Do not pass client Host header unless optsetter PassHostHeader is set.</span>
              <span style="color: #89DDFF;">if</span> passHostHeader != <span style="color: #f78c6c;">nil</span> &amp;&amp; <span style="color: #89DDFF; font-weight: bold;">!</span>*passHostHeader {
                  outReq.Host = outReq.URL.Host
              }

              <span style="color: #676E95;">// </span><span style="color: #676E95;">Even if the websocket RFC says that headers should be case-insensitive,</span>
              <span style="color: #676E95;">// </span><span style="color: #676E95;">some servers need Sec-WebSocket-Key, Sec-WebSocket-Extensions, Sec-WebSocket-Accept,</span>
              <span style="color: #676E95;">// </span><span style="color: #676E95;">Sec-WebSocket-Protocol and Sec-WebSocket-Version to be case-sensitive.</span>
              <span style="color: #676E95;">// </span><span style="color: #676E95;">https://tools.ietf.org/html/rfc6455#page-20</span>
              outReq.Header[<span style="color: #c3e88d;">"Sec-WebSocket-Key"</span>] = outReq.Header[<span style="color: #c3e88d;">"Sec-Websocket-Key"</span>]
              outReq.Header[<span style="color: #c3e88d;">"Sec-WebSocket-Extensions"</span>] = outReq.Header[<span style="color: #c3e88d;">"Sec-Websocket-Extensions"</span>]
              outReq.Header[<span style="color: #c3e88d;">"Sec-WebSocket-Accept"</span>] = outReq.Header[<span style="color: #c3e88d;">"Sec-Websocket-Accept"</span>]
              outReq.Header[<span style="color: #c3e88d;">"Sec-WebSocket-Protocol"</span>] = outReq.Header[<span style="color: #c3e88d;">"Sec-Websocket-Protocol"</span>]
              outReq.Header[<span style="color: #c3e88d;">"Sec-WebSocket-Version"</span>] = outReq.Header[<span style="color: #c3e88d;">"Sec-Websocket-Version"</span>]
              <span style="color: #82aaff;">delete</span>(outReq.Header, <span style="color: #c3e88d;">"Sec-Websocket-Key"</span>)
              <span style="color: #82aaff;">delete</span>(outReq.Header, <span style="color: #c3e88d;">"Sec-Websocket-Extensions"</span>)
              <span style="color: #82aaff;">delete</span>(outReq.Header, <span style="color: #c3e88d;">"Sec-Websocket-Accept"</span>)
              <span style="color: #82aaff;">delete</span>(outReq.Header, <span style="color: #c3e88d;">"Sec-Websocket-Protocol"</span>)
              <span style="color: #82aaff;">delete</span>(outReq.Header, <span style="color: #c3e88d;">"Sec-Websocket-Version"</span>)
          },
          <span style="color: #f78c6c;">Transport</span>:     roundTripper,
          <span style="color: #f78c6c;">FlushInterval</span>: time.<span style="color: #82aaff;">Duration</span>(flushInterval),
          <span style="color: #f78c6c;">BufferPool</span>:    bufferPool,
          <span style="color: #f78c6c;">ErrorHandler</span>: <span style="color: #89DDFF;">func</span>(<span style="color: #ffcb6b;">w</span> <span style="color: #c792ea;">http.ResponseWriter</span>, <span style="color: #ffcb6b;">request</span> *<span style="color: #c792ea;">http.Request</span>, <span style="color: #ffcb6b;">err</span> <span style="color: #c792ea;">error</span>) {
              <span style="color: #ffcb6b;">statusCode</span> := http.StatusInternalServerError

              <span style="color: #89DDFF;">switch</span> {
              <span style="color: #89DDFF;">case</span> err == io.EOF:
                  statusCode = http.StatusBadGateway
              <span style="color: #89DDFF;">case</span> err == context.Canceled:
                  statusCode = StatusClientClosedRequest
              <span style="color: #89DDFF;">default</span>:
                  <span style="color: #89DDFF;">if</span> <span style="color: #ffcb6b;">e</span>, <span style="color: #ffcb6b;">ok</span> := err.(<span style="color: #c792ea;">net.Error</span>); ok {
                      <span style="color: #89DDFF;">if</span> e.<span style="color: #82aaff;">Timeout</span>() {
                          statusCode = http.StatusGatewayTimeout
                      } <span style="color: #89DDFF;">else</span> {
                          statusCode = http.StatusBadGateway
                      }
                  }
              }

              log.<span style="color: #82aaff;">Debugf</span>(<span style="color: #c3e88d;">"'%d %s' caused by: %v"</span>, statusCode, <span style="color: #82aaff;">statusText</span>(statusCode), err)
              w.<span style="color: #82aaff;">WriteHeader</span>(statusCode)
              <span style="color: #ffcb6b;">_</span>, <span style="color: #ffcb6b;">werr</span> := w.<span style="color: #82aaff;">Write</span>([]<span style="color: #82aaff;">byte</span>(<span style="color: #82aaff;">statusText</span>(statusCode)))
              <span style="color: #89DDFF;">if</span> werr != <span style="color: #f78c6c;">nil</span> {
                  log.<span style="color: #82aaff;">Debugf</span>(<span style="color: #c3e88d;">"Error while writing status code"</span>, werr)
              }
          },
      }

      <span style="color: #89DDFF;">return</span> proxy, <span style="color: #f78c6c;">nil</span>
  }
</pre>
</div>
<p>
这里没有设置的代理的后端地址的原因是，负责均衡包会动态改变请求的后端地址，所以反向代理就不用更改了。
</p>
</div>
</div>
