org/traefik.org
*** TCP 协议
tcp协议的反向代理原理也很简单，主要是向代理的后端建立一个tcp连接，然后执行io.Copy执行数据，代码如下：
#+begin_src go
  // ServeTCP forwards the connection to a service.
  func (p *Proxy) ServeTCP(ctx context.Context, conn WriteCloser) {
          log.Debugf("Handling connection from %s", conn.RemoteAddr())
          // needed because of e.g. server.trackedConnection
          defer conn.Close()

          var (
                  connBackend WriteCloser
                  err         error
          )
          // 向代理的后端建立一条tcp连接
          connBackend, err = net.DialTCP("tcp", nil, p.target)
          if err != nil {
                  log.Errorf("Error while connection to backend: %v", err)
                  return
          }

          // maybe not needed, but just in case
          defer connBackend.Close()

          errChan := make(chan error)
          // 把请求的数据复制到后端
          // 把返回的数据复制到请求端
          go p.connCopy(conn, connBackend, errChan)
          go p.connCopy(connBackend, conn, errChan)

          err = <-errChan
          if err != nil {
                  log.WithoutContext().Errorf("Error during connection: %v", err)
          }

          <-errChan
  }
#+end_src
** 负载均衡
负载均衡对一个反向代理来说是一个非常重要的功能，对于http协议来说很容易做到请求级别的负载均衡，但是对于tcp协议来说只能做到连接的负载均衡(ps: 除非解析具体的tcp协议)
HTTP 协议的负载均衡主要使用的是 https://github.com/vulcand/oxy/roundrobin 这个第三方包。相关代码如下：
#+begin_src go
func (m *Manager) getLoadBalancer(ctx context.Context, serviceName string, service *dynamic.ServersLoadBalancer, fwd http.Handler) (healthcheck.BalancerHandler, error) {
	logger := log.FromContext(ctx)
	logger.Debug("Creating load-balancer")

	var options []roundrobin.LBOption

	var cookieName string
	if service.Sticky != nil && service.Sticky.Cookie != nil {
		cookieName = cookie.GetName(service.Sticky.Cookie.Name, serviceName)

		opts := roundrobin.CookieOptions{
			HTTPOnly: service.Sticky.Cookie.HTTPOnly,
			Secure:   service.Sticky.Cookie.Secure,
			SameSite: convertSameSite(service.Sticky.Cookie.SameSite),
		}

		options = append(options, roundrobin.EnableStickySession(roundrobin.NewStickySessionWithOptions(cookieName, opts)))

		logger.Debugf("Sticky session cookie name: %v", cookieName)
	}

	lb, err := roundrobin.New(fwd, options...)
	if err != nil {
		return nil, err
	}

	lbsu := healthcheck.NewLBStatusUpdater(lb, m.configs[serviceName])
	if err := m.upsertServers(ctx, lbsu, service.Servers); err != nil {
		return nil, fmt.Errorf("error configuring load balancer for service %s: %w", serviceName, err)
	}

	return lbsu, nil
}
#+end_src
** 配置获取
Traefik的配置来源支持多种方式，这可以在代理的provider目录中看见，每一种类型的proivder需要实现以下interface：
#+begin_src go
// Provider defines methods of a provider.
type Provider interface {
	// Provide allows the provider to provide configurations to traefik
	// using the given configuration channel.
	Provide(configurationChan chan<- dynamic.Message, pool *safe.Pool) error
	Init() error
}
#+end_src
当前支持的配置来源有：
- Docker
- Kubernetes
- Consul Catalog
- ECS	
- Marathon	
- Rancher	
- File	
- Consul
- Etcd	
- ZooKeeper	
- Redis
- HTTP
** 动态插件
Traefik为了能够动态加载自定义中间件，实现了一个很有趣的功能，就是插件功能，通过实现了一个完全兼容go的解释器：https://github.com/traefik/yaegi, 当插件load后会通过解释器执行你的自定义插件，来更改实现中间件的目的。但是个人不大喜欢这种方式，第一：解释执行会对性能有一定损耗，而且对一个反向代理服务来说，qps是比较高的。第二：目前虽然go是一直向前兼容，但是要是出现不兼容的go版本，这个解释器就比较麻烦了。
** 中间件
Traefik 目前自带很多中间件，比如修改header，修改path等。对于http协议还是比较方便的。目前支持以下中间件：
  - AddPrefix
  - BasicAuth
  - Buffering
  - Chain
  - CircuitBreaker
  - Compress
  - DigestAuth
  - Errors
  - ForwardAuth
  - Headers
  - IPWhiteList
  - InFlightReq
  - PassTLSClientCert
  - RateLimit
  - RedirectScheme
  - RedirectRegex
  - ReplacePath
  - ReplacePathRegex
  - Retry
  - StripPrefix
  - StripPrefixRegex
可以看到Traefik目前支持很多中间件，一般来说已经够用了，如果不够用可以fork代码修改或者使用plugin机制。

