traefik.html
<div id="outline-container-orgb207aec" class="outline-3">
<h3 id="orgb207aec"><span class="section-number-3">2.3</span> TCP 协议</h3>
<div class="outline-text-3" id="text-2-3">
<p>
tcp协议的反向代理原理也很简单，主要是向代理的后端建立一个tcp连接，然后执行io.Copy执行数据，代码如下：
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #676E95;">// </span><span style="color: #676E95;">ServeTCP forwards the connection to a service.</span>
<span style="color: #89DDFF;">func</span> (<span style="color: #ffcb6b;">p</span> *<span style="color: #c792ea;">Proxy</span>) <span style="color: #82aaff;">ServeTCP</span>(<span style="color: #ffcb6b;">ctx</span> <span style="color: #c792ea;">context.Context</span>, <span style="color: #ffcb6b;">conn</span> <span style="color: #c792ea;">WriteCloser</span>) {
    log.<span style="color: #82aaff;">Debugf</span>(<span style="color: #c3e88d;">"Handling connection from %s"</span>, conn.<span style="color: #82aaff;">RemoteAddr</span>())
    <span style="color: #676E95;">// </span><span style="color: #676E95;">needed because of e.g. server.trackedConnection</span>
    <span style="color: #89DDFF;">defer</span> conn.<span style="color: #82aaff;">Close</span>()

    <span style="color: #89DDFF;">var</span> (
        <span style="color: #ffcb6b;">connBackend</span> <span style="color: #c792ea;">WriteCloser</span>
        <span style="color: #ffcb6b;">err</span>         <span style="color: #c792ea;">error</span>
    )
    <span style="color: #676E95;">// </span><span style="color: #676E95;">&#21521;&#20195;&#29702;&#30340;&#21518;&#31471;&#24314;&#31435;&#19968;&#26465;tcp&#36830;&#25509;</span>
    connBackend, err = net.<span style="color: #82aaff;">DialTCP</span>(<span style="color: #c3e88d;">"tcp"</span>, <span style="color: #f78c6c;">nil</span>, p.target)
    <span style="color: #89DDFF;">if</span> err != <span style="color: #f78c6c;">nil</span> {
        log.<span style="color: #82aaff;">Errorf</span>(<span style="color: #c3e88d;">"Error while connection to backend: %v"</span>, err)
        <span style="color: #89DDFF;">return</span>
    }

    <span style="color: #676E95;">// </span><span style="color: #676E95;">maybe not needed, but just in case</span>
    <span style="color: #89DDFF;">defer</span> connBackend.<span style="color: #82aaff;">Close</span>()

    <span style="color: #ffcb6b;">errChan</span> := <span style="color: #82aaff;">make</span>(<span style="color: #89DDFF;">chan</span> <span style="color: #c792ea;">error</span>)
    <span style="color: #676E95;">// </span><span style="color: #676E95;">&#25226;&#35831;&#27714;&#30340;&#25968;&#25454;&#22797;&#21046;&#21040;&#21518;&#31471;</span>
    <span style="color: #676E95;">// </span><span style="color: #676E95;">&#25226;&#36820;&#22238;&#30340;&#25968;&#25454;&#22797;&#21046;&#21040;&#35831;&#27714;&#31471;</span>
    <span style="color: #89DDFF;">go</span> p.<span style="color: #82aaff;">connCopy</span>(conn, connBackend, errChan)
    <span style="color: #89DDFF;">go</span> p.<span style="color: #82aaff;">connCopy</span>(connBackend, conn, errChan)

    err = &lt;-errChan
    <span style="color: #89DDFF;">if</span> err != <span style="color: #f78c6c;">nil</span> {
        log.<span style="color: #82aaff;">WithoutContext</span>().<span style="color: #82aaff;">Errorf</span>(<span style="color: #c3e88d;">"Error during connection: %v"</span>, err)
    }

    &lt;-errChan
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgca6a988" class="outline-3">
<h3 id="orgca6a988"><span class="section-number-3">2.4</span> 负载均衡</h3>
<div class="outline-text-3" id="text-2-4">
<p>
负载均衡对一个反向代理来说是一个非常重要的功能，对于http协议来说很容易做到请求级别的负载均衡，但是对于tcp协议来说只能做到连接的负载均衡(ps: 除非解析具体的tcp协议)
HTTP 协议的负载均衡主要使用的是 <a href="https://github.com/vulcand/oxy/roundrobin">https://github.com/vulcand/oxy/roundrobin</a> 这个第三方包。相关代码如下：
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #89DDFF;">func</span> (<span style="color: #ffcb6b;">m</span> *<span style="color: #c792ea;">Manager</span>) <span style="color: #82aaff;">getLoadBalancer</span>(<span style="color: #ffcb6b;">ctx</span> <span style="color: #c792ea;">context.Context</span>, <span style="color: #ffcb6b;">serviceName</span> <span style="color: #c792ea;">string</span>, <span style="color: #ffcb6b;">service</span> *<span style="color: #c792ea;">dynamic.ServersLoadBalancer</span>, <span style="color: #ffcb6b;">fwd</span> <span style="color: #c792ea;">http.Handler</span>) (<span style="color: #c792ea;">healthcheck.BalancerHandler</span>, <span style="color: #c792ea;">error</span>) {
    <span style="color: #ffcb6b;">logger</span> := log.<span style="color: #82aaff;">FromContext</span>(ctx)
    logger.<span style="color: #82aaff;">Debug</span>(<span style="color: #c3e88d;">"Creating load-balancer"</span>)

    <span style="color: #89DDFF;">var</span> <span style="color: #ffcb6b;">options</span> []<span style="color: #c792ea;">roundrobin.LBOption</span>

    <span style="color: #89DDFF;">var</span> <span style="color: #ffcb6b;">cookieName</span> <span style="color: #c792ea;">string</span>
    <span style="color: #89DDFF;">if</span> service.Sticky != <span style="color: #f78c6c;">nil</span> &amp;&amp; service.Sticky.Cookie != <span style="color: #f78c6c;">nil</span> {
        cookieName = cookie.<span style="color: #82aaff;">GetName</span>(service.Sticky.Cookie.Name, serviceName)

        <span style="color: #ffcb6b;">opts</span> := <span style="color: #c792ea;">roundrobin.CookieOptions</span>{
            <span style="color: #f78c6c;">HTTPOnly</span>: service.Sticky.Cookie.HTTPOnly,
            <span style="color: #f78c6c;">Secure</span>:   service.Sticky.Cookie.Secure,
            <span style="color: #f78c6c;">SameSite</span>: <span style="color: #82aaff;">convertSameSite</span>(service.Sticky.Cookie.SameSite),
        }

        options = <span style="color: #82aaff;">append</span>(options, roundrobin.<span style="color: #82aaff;">EnableStickySession</span>(roundrobin.<span style="color: #82aaff;">NewStickySessionWithOptions</span>(cookieName, opts)))

        logger.<span style="color: #82aaff;">Debugf</span>(<span style="color: #c3e88d;">"Sticky session cookie name: %v"</span>, cookieName)
    }

    <span style="color: #ffcb6b;">lb</span>, <span style="color: #ffcb6b;">err</span> := roundrobin.<span style="color: #82aaff;">New</span>(fwd, options...)
    <span style="color: #89DDFF;">if</span> err != <span style="color: #f78c6c;">nil</span> {
        <span style="color: #89DDFF;">return</span> <span style="color: #f78c6c;">nil</span>, err
    }

    <span style="color: #ffcb6b;">lbsu</span> := healthcheck.<span style="color: #82aaff;">NewLBStatusUpdater</span>(lb, m.configs[serviceName])
    <span style="color: #89DDFF;">if</span> <span style="color: #ffcb6b;">err</span> := m.<span style="color: #82aaff;">upsertServers</span>(ctx, lbsu, service.Servers); err != <span style="color: #f78c6c;">nil</span> {
        <span style="color: #89DDFF;">return</span> <span style="color: #f78c6c;">nil</span>, fmt.<span style="color: #82aaff;">Errorf</span>(<span style="color: #c3e88d;">"error configuring load balancer for service %s: %w"</span>, serviceName, err)
    }

    <span style="color: #89DDFF;">return</span> lbsu, <span style="color: #f78c6c;">nil</span>
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orga08195a" class="outline-3">
<h3 id="orga08195a"><span class="section-number-3">2.5</span> 配置获取</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Traefik的配置来源支持多种方式，这可以在代理的provider目录中看见，每一种类型的proivder需要实现以下interface：
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #676E95;">// </span><span style="color: #676E95;">Provider defines methods of a provider.</span>
<span style="color: #89DDFF;">type</span> <span style="color: #c792ea;">Provider</span> <span style="color: #89DDFF;">interface</span> {
    <span style="color: #676E95;">// </span><span style="color: #676E95;">Provide allows the provider to provide configurations to traefik</span>
    <span style="color: #676E95;">// </span><span style="color: #676E95;">using the given configuration channel.</span>
    <span style="color: #82aaff;">Provide</span>(<span style="color: #ffcb6b;">configurationChan</span> <span style="color: #89DDFF;">chan</span>&lt;- <span style="color: #c792ea;">dynamic.Message</span>, <span style="color: #ffcb6b;">pool</span> *<span style="color: #c792ea;">safe.Pool</span>) <span style="color: #c792ea;">error</span>
    <span style="color: #82aaff;">Init</span>() <span style="color: #c792ea;">error</span>
}
</pre>
</div>
<p>
当前支持的配置来源有：
</p>
<ul class="org-ul">
<li>Docker</li>
<li>Kubernetes</li>
<li>Consul Catalog</li>
<li>ECS</li>
<li>Marathon</li>
<li>Rancher</li>
<li>File</li>
<li>Consul</li>
<li>Etcd</li>
<li>ZooKeeper</li>
<li>Redis</li>
<li>HTTP</li>
</ul>
</div>
</div>
<div id="outline-container-orga7583eb" class="outline-3">
<h3 id="orga7583eb"><span class="section-number-3">2.6</span> 动态插件</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Traefik为了能够动态加载自定义中间件，实现了一个很有趣的功能，就是插件功能，通过实现了一个完全兼容go的解释器：<a href="https://github.com/traefik/yaegi">https://github.com/traefik/yaegi</a>, 当插件load后会通过解释器执行你的自定义插件，来更改实现中间件的目的。但是个人不大喜欢这种方式，第一：解释执行会对性能有一定损耗，而且对一个反向代理服务来说，qps是比较高的。第二：目前虽然go是一直向前兼容，但是要是出现不兼容的go版本，这个解释器就比较麻烦了。
</p>
</div>
</div>
<div id="outline-container-org3fe4339" class="outline-3">
<h3 id="org3fe4339"><span class="section-number-3">2.7</span> 中间件</h3>
<div class="outline-text-3" id="text-2-7">
<p>
Traefik 目前自带很多中间件，比如修改header，修改path等。对于http协议还是比较方便的。目前支持以下中间件：
</p>
<ul class="org-ul">
<li>AddPrefix</li>
<li>BasicAuth</li>
<li>Buffering</li>
<li>Chain</li>
<li>CircuitBreaker</li>
<li>Compress</li>
<li>DigestAuth</li>
<li>Errors</li>
<li>ForwardAuth</li>
<li>Headers</li>
<li>IPWhiteList</li>
<li>InFlightReq</li>
<li>PassTLSClientCert</li>
<li>RateLimit</li>
<li>RedirectScheme</li>
<li>RedirectRegex</li>
<li>ReplacePath</li>
<li>ReplacePathRegex</li>
<li>Retry</li>
<li>StripPrefix</li>
<li>StripPrefixRegex</li>
</ul>
<p>
可以看到Traefik目前支持很多中间件，一般来说已经够用了，如果不够用可以fork代码修改或者使用plugin机制。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="gitalk" /> <script> var gitalk = new Gitalk({
  clientID: 'f30e66bb5ab9089aa742',
  clientSecret: '5d256d445447bd4db16540c2aab0e0884218ed12',
  repo: 'guidao.github.io',
  owner: 'guidao',
  admin: ['guidao'],
  id: 'gitalk',      // Ensure uniqueness and length less than 50
  distractionFreeMode: false  // Facebook-like distraction free mode
})
gitalk.render('gitalk') </script>
</div>
</body>
</html>
